In [1]:
import numpy as np
import pandas as pd

### writing dataframe to CSV
[source](https://stackoverflow.com/questions/16923281/pandas-writing-dataframe-to-csv-file)

In [2]:
df = pd.DataFrame({'A': 'foo bar foo bar foo bar foo foo'.split(),
                   'B': 'one one two three two two one three'.split(),
                   'C': np.arange(8), 'D': np.arange(8) * 2})
df

     A      B  C   D
0  foo    one  0   0
1  bar    one  1   2
2  foo    two  2   4
3  bar  three  3   6
4  foo    two  4   8
5  bar    two  5  10
6  foo    one  6  12
7  foo  three  7  14

In [3]:
# To delimit by a tab you can use the sep argument of to_csv
file_name = 'sample.csv'
df.to_csv(file_name, sep='\t')

In [4]:
# To use a specific encoding (e.g. 'utf-8') use the encoding argument
file_name = 'sample.csv'
df.to_csv(file_name, sep='\t', encoding='utf-8')

### iloc, and loc difference
[source](https://stackoverflow.com/questions/31593201/how-are-iloc-ix-and-loc-different)

In [5]:
s = pd.Series(np.nan, index=[49,48,47,46,45, 1, 2, 3, 4, 5])
s

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
dtype: float64

In [6]:
s.iloc[:3]

49   NaN
48   NaN
47   NaN
dtype: float64

In [7]:
s.loc[:3]

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [8]:
s.iloc[:6]

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
dtype: float64

In [9]:
s.loc[:6]

KeyError: 6

### SettingWithCopyWarning

In [10]:
# The SettingWithCopyWarning was created to flag potentially confusing "chained" assignments, 
# such as the following, which don't always work as expected, particularly when the first selection returns a copy.
df = pd.DataFrame({'A': np.arange(8), 'B': np.arange(8) * 2})
df

   A   B
0  0   0
1  1   2
2  2   4
3  3   6
4  4   8
5  5  10
6  6  12
7  7  14

In [11]:
new_val = 99
df[df['A'] > 2]['B'] = new_val
df

c:\users\kurijer\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

   A   B
0  0   0
1  1   2
2  2   4
3  3   6
4  4   8
5  5  10
6  6  12
7  7  14

In [12]:
df.loc[df['A'] > 2, 'B'] = new_val
df

   A   B
0  0   0
1  1   2
2  2   4
3  3  99
4  4  99
5  5  99
6  6  99
7  7  99

###  list of dictionaries to a DataFrame
[source](https://stackoverflow.com/questions/20638006/convert-list-of-dictionaries-to-a-pandas-dataframe)

In [13]:
d = [{'points': 50, 'time': '5:00', 'year': 2010},
     {'points': 25, 'time': '6:00', 'month': "february"},
     {'points': 90, 'time': '9:00', 'month': 'january'},
     {'points_h1': 20, 'month': 'june'}]

In [14]:
pd.DataFrame(d)

      month  points  points_h1  time    year
0       NaN    50.0        NaN  5:00  2010.0
1  february    25.0        NaN  6:00     NaN
2   january    90.0        NaN  9:00     NaN
3      june     NaN       20.0   NaN     NaN

### expand the output display to see more columns
[source](https://stackoverflow.com/questions/11707586/how-do-i-expand-the-output-display-to-see-more-columns)

In [15]:
import pandas as pd
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)

### Pretty-print dataframe
[source](https://stackoverflow.com/questions/19124601/pretty-print-an-entire-pandas-series-dataframe)

In [16]:
df = pd.DataFrame({'A': 'foo bar foo bar foo bar foo foo'.split(),
                   'B': 'one one two three two two one three'.split(),
                   'C': np.arange(8), 'D': np.arange(8) * 2})
df

     A      B  C   D
0  foo    one  0   0
1  bar    one  1   2
2  foo    two  2   4
3  bar  three  3   6
4  foo    two  4   8
5  bar    two  5  10
6  foo    one  6  12
7  foo  three  7  14

In [17]:
# more options can be specified also
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(df)

     A      B  C   D
0  foo    one  0   0
1  bar    one  1   2
2  foo    two  2   4
3  bar  three  3   6
4  foo    two  4   8
5  bar    two  5  10
6  foo    one  6  12
7  foo  three  7  14

In [18]:
print(df.to_string())

     A      B  C   D
0  foo    one  0   0
1  bar    one  1   2
2  foo    two  2   4
3  bar  three  3   6
4  foo    two  4   8
5  bar    two  5  10
6  foo    one  6  12
7  foo  three  7  14

### GroupBy object to DataFrame
[source](https://stackoverflow.com/questions/10373660/converting-a-pandas-groupby-object-to-dataframe)

In [19]:
df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Mallory", "Mallory", "Bob", "Mallory"],
    "City": ["Seattle", "Seattle", "Portland", "Seattle", "Seattle", "Portland"]})
df

      Name      City
0    Alice   Seattle
1      Bob   Seattle
2  Mallory  Portland
3  Mallory   Seattle
4      Bob   Seattle
5  Mallory  Portland

In [20]:
df = pd.DataFrame({'count': df.groupby(["Name", "City"]).size()}).reset_index()
df

      Name      City  count
0    Alice   Seattle      1
1      Bob   Seattle      2
2  Mallory  Portland      2
3  Mallory   Seattle      1

### Deleting DataFrame row based on column value
[source](https://stackoverflow.com/questions/18172851/deleting-dataframe-row-in-pandas-based-on-column-value)

In [21]:
df = pd.DataFrame({'A': 'foo bar foo bar foo bar foo foo'.split(),
                   'B': 'one one two three two two one three'.split(),
                   'C': np.arange(8), 'D': np.arange(8) * 2})
df

     A      B  C   D
0  foo    one  0   0
1  bar    one  1   2
2  foo    two  2   4
3  bar  three  3   6
4  foo    two  4   8
5  bar    two  5  10
6  foo    one  6  12
7  foo  three  7  14

In [22]:
df = df[df['D'] > 4]
df

     A      B  C   D
3  bar  three  3   6
4  foo    two  4   8
5  bar    two  5  10
6  foo    one  6  12
7  foo  three  7  14

### check if any value is NaN in a DataFrame
[source](https://stackoverflow.com/questions/29530232/how-to-check-if-any-value-is-nan-in-a-pandas-dataframe)

In [23]:
df = pd.DataFrame(np.random.randn(10,3))
df.iloc[::2,0] = np.nan; df.iloc[::4,1] = np.nan; df.iloc[::3,2] = np.nan;
df

          0         1         2
0       NaN       NaN       NaN
1  2.194074  0.312224  0.288679
2       NaN -0.898224 -1.513737
3 -0.679891  0.981355       NaN
4       NaN       NaN  0.045939
5 -0.717876  0.691315 -1.165453
6       NaN -1.026218       NaN
7 -0.270246  0.769138  0.128025
8       NaN       NaN  1.046045
9  1.121586  0.483019       NaN

In [24]:
df.isnull().values.any()

True

In [25]:
df.isnull().sum()

0    5
1    3
2    4
dtype: int64

### Filter dataframe rows if value in column is in a set list of values
[source](https://stackoverflow.com/questions/12065885/filter-dataframe-rows-if-value-in-column-is-in-a-set-list-of-values)

In [26]:
df = pd.DataFrame({'A': 'foo bar foo bar foo bar foo foo'.split(),
                   'B': 'one one two three two two one three'.split(),
                   'C': np.arange(8), 'D': np.arange(8) * 2})
df

     A      B  C   D
0  foo    one  0   0
1  bar    one  1   2
2  foo    two  2   4
3  bar  three  3   6
4  foo    two  4   8
5  bar    two  5  10
6  foo    one  6  12
7  foo  three  7  14

In [27]:
df.loc[df['C'].isin([1, 2, 4, 7])]

     A      B  C   D
1  bar    one  1   2
2  foo    two  2   4
4  foo    two  4   8
7  foo  three  7  14

### Difference between map, applymap and apply
[source](https://stackoverflow.com/questions/19798153/difference-between-map-applymap-and-apply-methods-in-pandas)

In [28]:
df = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df

               b         d         e
Utah   -0.729169 -1.195972  0.385558
Ohio   -1.240309 -0.189206 -0.460651
Texas   1.037790 -0.541335  1.174977
Oregon -0.477049  1.392297 -0.956432

In [29]:
# apply works on a row / column basis of a DataFrame
f = lambda x: x.max() - x.min()
df.apply(f)

b    2.278098
d    2.588269
e    2.131409
dtype: float64

In [30]:
# applymap works element-wise on a DataFrame
f = lambda x: '%.2f' % x
df.applymap(f)

            b      d      e
Utah    -0.73  -1.20   0.39
Ohio    -1.24  -0.19  -0.46
Texas    1.04  -0.54   1.17
Oregon  -0.48   1.39  -0.96

In [31]:
# map works element-wise on a Series
df['e'].map(f)

Utah       0.39
Ohio      -0.46
Texas      1.17
Oregon    -0.96
Name: e, dtype: object

### replace all the NaN values with Zero's in a column
[source](https://stackoverflow.com/questions/13295735/how-can-i-replace-all-the-nan-values-with-zeros-in-a-column-of-a-pandas-datafra)

In [32]:
df = pd.DataFrame(np.random.randn(10,3))
df.iloc[::2,0] = np.nan; df.iloc[::4,1] = np.nan; df.iloc[::3,2] = np.nan;
df

          0         1         2
0       NaN       NaN       NaN
1 -1.026708 -1.112981 -1.903730
2       NaN  1.224941  0.584234
3  1.076025  0.460541       NaN
4       NaN       NaN -1.119044
5  1.397757  0.913811  1.346124
6       NaN -0.956486       NaN
7  0.304887  0.413711  1.125700
8       NaN       NaN -0.459584
9  0.919486 -0.319057       NaN

In [33]:
df = df.fillna(0)
df

          0         1         2
0  0.000000  0.000000  0.000000
1 -1.026708 -1.112981 -1.903730
2  0.000000  1.224941  0.584234
3  1.076025  0.460541  0.000000
4  0.000000  0.000000 -1.119044
5  1.397757  0.913811  1.346124
6  0.000000 -0.956486  0.000000
7  0.304887  0.413711  1.125700
8  0.000000  0.000000 -0.459584
9  0.919486 -0.319057  0.000000

### Selecting a row of pandas series/dataframe by integer index
[source](https://stackoverflow.com/questions/16096627/selecting-a-row-of-pandas-series-dataframe-by-integer-index)

In [34]:
df = pd.DataFrame(np.random.rand(5,2),index=range(0,10,2),columns=list('AB'))
df

          A         B
0  0.382711  0.814362
2  0.933910  0.498486
4  0.424001  0.607607
6  0.951986  0.114560
8  0.722800  0.164763

In [35]:
df.iloc[[2]]

          A         B
4  0.424001  0.607607

In [36]:
df.loc[[2]]

         A         B
2  0.93391  0.498486

### Set value for particular cell using index
[source](https://stackoverflow.com/questions/13842088/set-value-for-particular-cell-in-pandas-dataframe-using-index)

In [37]:
df = pd.DataFrame(index=['A','B','C'], columns=['x','y'])
df

     x    y
A  NaN  NaN
B  NaN  NaN
C  NaN  NaN

In [38]:
df.at['C', 'x'] = 10
df

     x    y
A  NaN  NaN
B  NaN  NaN
C   10  NaN

In [39]:
# depricated
df.set_value('C', 'y', 20)

c:\users\kurijer\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead

     x    y
A  NaN  NaN
B  NaN  NaN
C   10   20

### Combine two columns of text in dataframe
[source](https://stackoverflow.com/questions/19377969/combine-two-columns-of-text-in-dataframe-in-pandas-python)

In [40]:
df = pd.DataFrame({'A': 'foo bar foo bar foo bar foo foo'.split(),
                   'B': 'one one two three two two one three'.split()})
df

     A      B
0  foo    one
1  bar    one
2  foo    two
3  bar  three
4  foo    two
5  bar    two
6  foo    one
7  foo  three

In [41]:
df['C'] = df['A'] + ' ' + df['B']
df

     A      B          C
0  foo    one    foo one
1  bar    one    bar one
2  foo    two    foo two
3  bar  three  bar three
4  foo    two    foo two
5  bar    two    bar two
6  foo    one    foo one
7  foo  three  foo three